# OpenScriptResPal

## Description
Open or close a script resource palette.

```pascal
PROCEDURE OpenScriptResPal(
				paletteName : STRING;
				open        : BOOLEAN);
```

```python
def vs.OpenScriptResPal(paletteName, open):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|paletteName|STRING|The script resource palette.|
|open|BOOLEAN|Pass in TRUE for the palette to be opened.|

## Examples
```pascal
OpenScriptResPal('Example', TRUE);
```
```python
import vs

# Open or close a script resource palette.
paletteName = 'Example'
open = True

vs.OpenScriptResPal(paletteName, open)
```

## See Also
VS Functions:
CreateScriptResource
| GetScriptResource
| SetScriptResource

## Version
Availability: from Vectorworks 2014

## Category
* Utility